## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # zentral_mdm_ota_enrollment.default will be updated in-place
  ~ resource "zentral_mdm_ota_enrollment" "default" {
        id                    = 1
      ~ name                  = "Default" -> "Default "
      ~ secret                = "0ATcRnTyeNFvj7hYF77Zw5Mk5VTz1DJimII3gj6kRYrosCi9AqoSgn39Tfr1jSYW" -> (known after apply)
      ~ serial_numbers        = [] -> (known after apply)
      ~ tag_ids               = [] -> (known after apply)
      ~ udids                 = [] -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-auditing-audit_acls_files_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_acls_files_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit log files _MUST_ not contain access control lists (ACLs).
            
            This rule ensures that audit information and audit files are configured to be readable and writable only by system administrators, thereby preventing unauthorized access, modification, and deletion of files.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Files to Not Contain Access Control Lists"
      + source           = "/bin/ls -le $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_acls_folders_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_acls_folders_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit log folder _MUST_ not contain access control lists (ACLs).
            
            Audit logs contain sensitive data about the system and users. This rule ensures that the audit service is configured to create log folders that are readable and writable only by system administrators in order to prevent normal users from reading audit logs.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Folder to Not Contain Access Control Lists"
      + source           = "/bin/ls -lde /var/audit | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_auditd_enabled will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_auditd_enabled" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The information system _MUST_ be configured to generate audit records.
            
            Audit records establish what types of events have occurred, when they occurred, and which users were involved. These records aid an organization in their efforts to establish, correlate, and investigate the events leading up to an outage or attack.
            
            The content required to be captured in an audit record varies based on the impact level of an organization's system. Content that may be necessary to satisfy this requirement includes, for example, time stamps, source addresses, destination addresses, user identifiers, event descriptions, success/fail indications, filenames involved, and access or flow control rules invoked.
            
            The information system initiates session audits at system start-up.
            
            NOTE: Security auditing is NOT enabled by default on macOS Sonoma.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "pass"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Enable Security Auditing"
      + source           = <<-EOT
            LAUNCHD_RUNNING=$(/bin/launchctl list | /usr/bin/grep -c com.apple.auditd)
            AUDITD_RUNNING=$(/usr/sbin/audit -c | /usr/bin/grep -c "AUC_AUDITING")
            if [[ $LAUNCHD_RUNNING == 1 ]] && [[ -e /etc/security/audit_control ]] && [[ $AUDITD_RUNNING == 1 ]]; then
              echo "pass"
            else
              echo "fail"
            fi
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_acls_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_acls_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ not contain Access Control Lists (ACLs)."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control to Not Contain Access Control Lists"
      + source           = "/bin/ls -le /etc/security/audit_control | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_group_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_group_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ have the group set to wheel."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control Group to Wheel"
      + source           = "/bin/ls -dn /etc/security/audit_control | /usr/bin/awk '{print $4}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_mode_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_mode_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ be configured so that it is readable only by the root user and group wheel."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control Owner to Mode 440 or Less Permissive"
      + source           = "/bin/ls -l /etc/security/audit_control | /usr/bin/awk '!/-r--[r-]-----|current|total/{print $1}' | /usr/bin/wc -l | /usr/bin/xargs"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_owner_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_owner_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ have the owner set to root."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control Owner to Root"
      + source           = "/bin/ls -dn /etc/security/audit_control | /usr/bin/awk '{print $3}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_files_group_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_files_group_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Audit log files _MUST_ have the group set to wheel.
            
            The audit service _MUST_ be configured to create log files with the correct group ownership to prevent normal users from reading audit logs.
            
            Audit logs contain sensitive data about the system and users. If log files are set to be readable and writable only by system administrators, the risk is mitigated.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Files Group to Wheel"
      + source           = "/bin/ls -n $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{s+=$4} END {print s}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_files_mode_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_files_mode_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "The audit service _MUST_ be configured to create log files that are readable only by the root user and group wheel. To achieve this, audit log files _MUST_ be configured to mode 440 or less permissive; thereby preventing normal users from reading, modifying or deleting audit logs."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Files to Mode 440 or Less Permissive"
      + source           = "/bin/ls -l $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '!/-r--r-----|current|total/{print $1}' | /usr/bin/wc -l | /usr/bin/tr -d ' '"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_files_owner_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_files_owner_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Audit log files _MUST_ be owned by root.
            
            The audit service _MUST_ be configured to create log files with the correct ownership to prevent normal users from reading audit logs.
            
            Audit logs contain sensitive data about the system and users. If log files are set to only be readable and writable by system administrators, the risk is mitigated.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Files to be Owned by Root"
      + source           = "/bin/ls -n $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{s+=$3} END {print s}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_folder_group_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_folder_group_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Audit log files _MUST_ have the group set to wheel.
            
            The audit service _MUST_ be configured to create log files with the correct group ownership to prevent normal users from reading audit logs.
            
            Audit logs contain sensitive data about the system and users. If log files are set to be readable and writable only by system administrators, the risk is mitigated.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Folders Group to Wheel"
      + source           = "/bin/ls -dn $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{print $4}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_folder_owner_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_folder_owner_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Audit log folders _MUST_ be owned by root.
            
            The audit service _MUST_ be configured to create log folders with the correct ownership to prevent normal users from reading audit logs.
            
            Audit logs contain sensitive data about the system and users. If log folders are set to only be readable and writable by system administrators, the risk is mitigated.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Folders to be Owned by Root"
      + source           = "/bin/ls -dn $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{print $3}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_folders_mode_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_folders_mode_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit log folder _MUST_ be configured to mode 700 or less permissive so that only the root user is able to read, write, and execute changes to folders.
            
            Because audit logs contain sensitive data about the system and users, the audit service _MUST_ be configured to mode 700 or less permissive; thereby preventing normal users from reading, modifying or deleting audit logs.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "700"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Log Folders to Mode 700 or Less Permissive"
      + source           = "/usr/bin/stat -f %A $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}')"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_retention_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_retention_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The audit service _MUST_ be configured to require records be kept for a organizational defined value before deletion, unless the system uses a central audit record storage facility.
            
            When "expire-after" is set to "7d", the audit service will not delete audit logs until the log data criteria is met.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "7d"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit Retention to 7d"
      + source           = "/usr/bin/awk -F: '/expire-after/{print $2}' /etc/security/audit_control"
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_airdrop_disable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_airdrop_disable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
            AirDrop allows users to share and receive files from other nearby Apple devices.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "false"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Disable AirDrop"
      + source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
            .objectForKey('allowAirDrop').js
            EOS
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_anti_virus_installed will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_anti_virus_installed" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            An approved antivirus product _MUST_ be installed and configured to run.
            
            Malicious software can establish a base on individual desktops and servers. Employing an automated mechanism to detect this type of software will aid in elimination of the software from the operating system.'
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "2"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Must Use an Approved Antivirus Program"
      + source           = "/bin/launchctl list | /usr/bin/grep -cE \"(com.apple.XprotectFramework.PluginService$|com.apple.XProtect.daemon.scan$)\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_authenticated_root_enable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_authenticated_root_enable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Authenticated Root _MUST_ be enabled.
            
            When Authenticated Root is enabled the macOS is booted from a signed volume that is cryptographically protected to prevent tampering with the system volume.
            
            NOTE: Authenticated Root is enabled by default on macOS systems.
            
            WARNING: If more than one partition with macOS is detected, the csrutil command will hang awaiting input.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Enable Authenticated Root"
      + source           = "/usr/bin/csrutil authenticated-root | /usr/bin/grep -c 'enabled'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_config_data_install_enforce will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_config_data_install_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Software Update _MUST_ be configured to update XProtect Remediator and Gatekeeper automatically.
            
            This setting enforces definition updates for XProtect Remediator and Gatekeeper; with this setting in place, new malware and adware that Apple has added to the list of malware or untrusted software will not execute. These updates do not require the computer to be restarted.
            
            link:https://support.apple.com/en-us/HT207005[]
            
            NOTE: Software update will automatically update XProtect Remediator and Gatekeeper by default in the macOS.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "true"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Enforce Installation of XProtect Remediator and Gatekeeper Updates Automatically"
      + source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SoftwareUpdate')\
            .objectForKey('ConfigDataInstall').js
            EOS
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_firewall_log_enable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_firewall_log_enable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Firewall logging _MUST_ be enabled.
            
            Firewall logging ensures that malicious network activity will be logged to the system.
            
            NOTE: The firewall data is logged to Apple's Unified Logging with the subsystem `com.apple.alf` and the data is marked as private. In order to enable private data, review the `com.apple.alf.private_data.mobileconfig` file in the project's `includes` folder.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "true"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Enable Firewall Logging"
      + source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            function run() {
              let pref1 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
              .objectForKey('EnableLogging').js
              let pref2 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
              .objectForKey('LoggingOption').js
              if ( pref1 == true && pref2 == "detail" ){
                return("true")
              } else {
                return("false")
              }
            }
            EOS
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_gatekeeper_enable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_gatekeeper_enable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Gatekeeper _MUST_ be enabled.
            
            Gatekeeper is a security feature that ensures that applications are digitally signed by an Apple-issued certificate before they are permitted to run. Digital signatures allow the macOS host to verify that the application has not been modified by a malicious third party.
            
            Administrator users will still have the option to override these settings on a case-by-case basis.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Enable Gatekeeper"
      + source           = "/usr/sbin/spctl --status | /usr/bin/grep -c \"assessments enabled\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_guest_folder_removed will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_guest_folder_removed" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "The guest folder _MUST_ be deleted if present."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Remove Guest Folder if Present"
      + source           = "/bin/ls /Users/ | /usr/bin/grep -c \"Guest\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_home_folders_secure will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_home_folders_secure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The system _MUST_ be configured to prevent access to other user's home folders.
            
            The default behavior of macOS is to allow all valid users access to the top level of every other user's home folder while restricting access only to the Apple default folders within.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Secure User's Home Folders"
      + source           = "/usr/bin/find /System/Volumes/Data/Users -mindepth 1 -maxdepth 1 -type d ! \\( -perm 700 -o -perm 711 \\) | /usr/bin/grep -v \"Shared\" | /usr/bin/grep -v \"Guest\" | /usr/bin/wc -l | /usr/bin/xargs"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_httpd_disable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_httpd_disable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The built-in web server is a non-essential service built into macOS and _MUST_ be disabled.
            
            NOTE: The built in web server service is disabled at startup by default macOS.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Disable the Built-in Web Server"
      + source           = "/bin/launchctl print-disabled system | /usr/bin/grep -c '\"org.apache.httpd\" => disabled'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_install_log_retention_configure will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_install_log_retention_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "The install.log _MUST_ be configured to require records be kept for a organizational defined value before deletion, unless the system uses a central audit record storage facility."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "Yes"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Configure Install.log Retention to 365"
      + source           = "/usr/sbin/aslmanager -dd 2>&1 | /usr/bin/awk '/\\/var\\/log\\/install.log$/ {count++} /Processing module com.apple.install/,/Finished/ { for (i=1;i<=NR;i++) { if ($i == \"TTL\" && $(i+2) >= 365) { ttl=\"True\" }; if ($i == \"MAX\") {max=\"True\"}}} END{if (count > 1) { print \"Multiple config files for /var/log/install, manually remove the extra files\"} else if (max == \"True\") { print \"all_max setting is configured, must be removed\" } if (ttl != \"True\") { print \"TTL not configured\" } else { print \"Yes\" }}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_STR"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_mdm_require will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_mdm_require" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            You _MUST_ enroll your Mac in a Mobile Device Management (MDM) software.
            
            User Approved MDM (UAMDM) enrollment or enrollment via Apple Business Manager (ABM)/Apple School Manager (ASM) is required to manage certain security settings. Currently these include:
            
            * Allowed Kernel Extensions
            * Allowed Approved System Extensions
            * Privacy Preferences Policy Control Payload
            * ExtensibleSingleSignOn
            * FDEFileVault
            
            In macOS 11, UAMDM grants Supervised status on a Mac, unlocking the following MDM features, which were previously locked behind ABM:
            
            * Activation Lock Bypass
            * Access to Bootstrap Tokens
            * Scheduling Software Updates
            * Query list and delete local users
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "1"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Enforce Enrollment in Mobile Device Management"
      + source           = "/usr/bin/profiles status -type enrollment | /usr/bin/awk -F: '/MDM enrollment/ {print $2}' | /usr/bin/grep -c \"Yes (User Approved)\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_mobile_file_integrity_enable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_mobile_file_integrity_enable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "Mobile file integrity _MUST_ be ebabled."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Enable Apple Mobile File Integrity"
      + source           = "/usr/sbin/nvram -p | /usr/bin/grep -c \"amfi_get_out_of_my_way=1\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_nfsd_disable will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_nfsd_disable" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "Support for Network File Systems (NFS) services is non-essential and, therefore, _MUST_ be disabled."
      
--- TRUNCATED ---
```
</details>